marshallma21/AUTOSAR_SampleProject_MPC5748G/plugins/Mcu_TS_T2D35M10I0R0/include/Reg_eSys_MC_PCU.h
/* PCU_STAT[PD0] bit mask. */
#define MC_PCU_STAT_PD0_MASK32                  ((uint32)0x00000001U)


/********** PMU Registers **********/

#if (IPV_MC == IPV_MC_04_04_01_00)
    /* PMC - Status Register. */
    #define PMC_PMCSR_ADDR32                    ((uint32)(PMC_BASEADDR + (uint32)0x0000U))
    /* PMC - Regulator Voltage Status Register. */
    #define PMC_RSSR_ADDR32                     ((uint32)(PMC_BASEADDR + (uint32)0x0004U))
    /* PMC - Control Register. */
    #define PMC_PMCCR_ADDR32                    ((uint32)(PMC_BASEADDR + (uint32)0x0008U))
    /* PMC - Interrupt Enable Register. */
    #define PMC_IER_ADDR32                      ((uint32)(PMC_BASEADDR + (uint32)0x0010U))
    /* PMC - Event Status Register 0. */
    #define PMC_ESR_0_ADDR32                    ((uint32)(PMC_BASEADDR + (uint32)0x0020U))
    /* PMC - Reset Event Enable Register 0. */
    #define PMC_REE_0_ADDR32                    ((uint32)(PMC_BASEADDR + (uint32)0x0030U))
    /* PMC - Reset Event Selection Register 0. */
    #define PMC_RES_0_ADDR32                    ((uint32)(PMC_BASEADDR + (uint32)0x0040U))
    /* PMC - FCCU Fault Injection Register. */
    #define PMC_FIR_ADDR32                      ((uint32)(PMC_BASEADDR + (uint32)0x0070U))
    /* PMC - LVD Sense Select Register. */
    #define PMC_LVD_SS_ADDR32                   ((uint32)(PMC_BASEADDR + (uint32)0x00F0U))
    /* PMC - Temperature Event Status Register. */
    #define PMC_ESR_TD_ADDR32                   ((uint32)(PMC_BASEADDR + (uint32)0x0100U))
    /* PMC - Temperature Reset Event Enable Register. */
    #define PMC_REE_TD_ADDR32                   ((uint32)(PMC_BASEADDR + (uint32)0x0104U))
    /* PMC - Temperature Reset Event Selection Register. */
    #define PMC_RES_TD_ADDR32                   ((uint32)(PMC_BASEADDR + (uint32)0x0108U))
    /* PMC - Temperature Detector Configuration Register. */
    #define PMC_CTL_TD_ADDR32                   ((uint32)(PMC_BASEADDR + (uint32)0x010CU))
    /* PMC - LVD Self Test Time Window Register. */
    #define PMC_STTW_ADDR32                     ((uint32)(PMC_BASEADDR + (uint32)0x013CU))
    /* PMC - Voltage Detect User Mode Test Register. */
    #define PMC_VD_UTST_ADDR32                  ((uint32)(PMC_BASEADDR + (uint32)0x0140U))


    /****************************************************/
    /***              PMC_PMCCR                       ***/
    /****************************************************/
    #define PMC_PMCCR_RWBITS_MASK32                     ((uint32)0x80000003U)
    #define PMC_PMCCR_RESBITS_MASK32                    ((uint32)0x00000000U)

    #define PMC_PMCCR_PMCCR_EN_MASK32                   ((uint32)0x80000000U)
    /** @violates @ref Reg_eSys_MC_PCU_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define PMC_PMCCR_INT_AUX_REG_BYPASS_MASK32         ((uint32)0x00000002U)
    #define PMC_PMCCR_INT_REG_BYPASS_MASK32             ((uint32)0x00000001U)


    /****************************************************/
    /***              PMC_IER                         ***/
    /****************************************************/
    #define PMC_IER_RWBITS_MASK32                       ((uint32)0xBF007C98U)
    #define PMC_IER_RESBITS_MASK32                      ((uint32)0x00000000U)

    #define PMC_PMCCR_IE_EN_MASK32                      ((uint32)0x80000000U)
    #define PMC_IER_TS1_3IE_MASK32                      ((uint32)0x20000000U)
    #define PMC_IER_TS1_2IE_MASK32                      ((uint32)0x10000000U)
    #define PMC_IER_TS1_0IE_MASK32                      ((uint32)0x08000000U)
    #define PMC_IER_TS0_3IE_MASK32                      ((uint32)0x04000000U)
    #define PMC_IER_TS0_2IE_MASK32                      ((uint32)0x02000000U)
    #define PMC_IER_TS0_0IE_MASK32                      ((uint32)0x01000000U)
    #define PMC_IER_VD6IE_O_MASK32                      ((uint32)0x00004000U)
    #define PMC_IER_VD6IE_ADC_MASK32                    ((uint32)0x00002000U)
    #define PMC_IER_VD6IE_IM_MASK32                     ((uint32)0x00001000U)
    #define PMC_IER_VD6IE_F_MASK32                      ((uint32)0x00000800U)
    #define PMC_IER_VD6IE_C_MASK32                      ((uint32)0x00000400U)
    #define PMC_IER_VD4IE_C_MASK32                      ((uint32)0x00000080U)
    #define PMC_IER_VD3IE_H_MASK32                      ((uint32)0x00000010U)
    #define PMC_IER_VD3IE_C_MASK32                      ((uint32)0x00000008U)

    /* all temp sens bits */
    #define PMC_IER_TEMPI_E_MASK32                      ((uint32)0x3F000000U)
    /* all vsense bits */
    #define PMC_IER_VOLTI_E_MASK32                      ((uint32)0x00007C98U)


    /****************************************************/
    /***              PMC_ESR_0                       ***/
    /****************************************************/
    #define PMC_ESR_0_RWBITS_MASK32                     ((uint32)0x002A7D9BU)
    #define PMC_ESR_0_VD0_C_MASK32                      ((uint32)0x00200000U)
    #define PMC_ESR_0_VD15_C_MASK32                     ((uint32)0x00080000U)
    #define PMC_ESR_0_VD12_C_MASK32                     ((uint32)0x00020000U)
    #define PMC_ESR_0_VD6_O_MASK32                      ((uint32)0x00004000U)
    #define PMC_ESR_0_VD6_ADC_MASK32                    ((uint32)0x00002000U)
    #define PMC_ESR_0_VD6_IM_MASK32                     ((uint32)0x00001000U)
    #define PMC_ESR_0_VD6_F_MASK32                      ((uint32)0x00000800U)
    #define PMC_ESR_0_VD6_C_MASK32                      ((uint32)0x00000400U)
    #define PMC_ESR_0_VD5_C_MASK32                      ((uint32)0x00000100U)
    #define PMC_ESR_0_VD4_C_MASK32                      ((uint32)0x00000080U)
    #define PMC_ESR_0_VD3_H_MASK32                      ((uint32)0x00000010U)
    #define PMC_ESR_0_VD3_C_MASK32                      ((uint32)0x00000008U)
    #define PMC_ESR_0_VD2_C_MASK32                      ((uint32)0x00000002U)
    #define PMC_ESR_0_VD1_C_MASK32                      ((uint32)0x00000001U)


