marshallma21/AUTOSAR_SampleProject_MPC5748G/plugins/Mcu_TS_T2D35M10I0R0/include/Reg_eSys_MC_PCU.h
    /****************************************************/
    /***              PMC_REE_0                       ***/
    /****************************************************/
    #define PMC_REE_0_RWBITS_MASK32                     ((uint32)0x00007C98U)
    #define PMC_REE_0_RESBITS_MASK32                    ((uint32)0x00000000U)

    #define PMC_REE_0_VD6RE_O_MASK32                    ((uint32)0x00004000U)
    #define PMC_REE_0_VD6RE_ADC_MASK32                  ((uint32)0x00002000U)
    #define PMC_REE_0_VD6RE_IM_MASK32                   ((uint32)0x00001000U)
    #define PMC_REE_0_VD6RE_F_MASK32                    ((uint32)0x00000800U)
    #define PMC_REE_0_VD6RE_C_MASK32                    ((uint32)0x00000400U)
    #define PMC_REE_0_VD4RE_C_MASK32                    ((uint32)0x00000080U)
    #define PMC_REE_0_VD3RE_H_MASK32                    ((uint32)0x00000010U)
    #define PMC_REE_0_VD3RE_C_MASK32                    ((uint32)0x00000008U)


    /****************************************************/
    /***              PMC_RES_0                       ***/
    /****************************************************/
    #define PMC_RES_0_RWBITS_MASK32                     ((uint32)0x00007C98U)
    #define PMC_RES_0_RESBITS_MASK32                    ((uint32)0x00000000U)

    #define PMC_RES_0_VD6RE_O_MASK32                    ((uint32)0x00004000U)
    #define PMC_RES_0_VD6RE_ADC_MASK32                  ((uint32)0x00002000U)
    #define PMC_RES_0_VD6RE_IM_MASK32                   ((uint32)0x00001000U)
    #define PMC_RES_0_VD6RE_F_MASK32                    ((uint32)0x00000800U)
    #define PMC_RES_0_VD6RE_C_MASK32                    ((uint32)0x00000400U)
    #define PMC_RES_0_VD4RE_C_MASK32                    ((uint32)0x00000080U)
    #define PMC_RES_0_VD3RE_H_MASK32                    ((uint32)0x00000010U)
    #define PMC_RES_0_VD3RE_C_MASK32                    ((uint32)0x00000008U)


    /****************************************************/
    /***              PMC_ESR_TD                      ***/
    /****************************************************/
    #define PMC_ESR_TD_RWBITS_MASK32                    ((uint32)0x00000D0DU)



    /****************************************************/
    /***              PMC_REE_TD                      ***/
    /****************************************************/
    #define PMC_REE_TD_RWBITS_MASK32                    ((uint32)0x00000D0DU)
    #define PMC_REE_TD_RESBITS_MASK32                   ((uint32)0x00000000U)

    #define PMC_REE_TD_TEMP1_3_MASK32                   ((uint32)0x00000800U)
    #define PMC_REE_TD_TEMP1_2_MASK32                   ((uint32)0x00000400U)
    #define PMC_REE_TD_TEMP1_0_MASK32                   ((uint32)0x00000100U)
    #define PMC_REE_TD_TEMP0_3_MASK32                   ((uint32)0x00000008U)
    #define PMC_REE_TD_TEMP0_2_MASK32                   ((uint32)0x00000004U)
    #define PMC_REE_TD_TEMP0_0_MASK32                   ((uint32)0x00000001U)


    /****************************************************/
    /***              PMC_RES_TD                      ***/
    /****************************************************/
    #define PMC_RES_TD_RWBITS_MASK32                    ((uint32)0x00000D0DU)
    #define PMC_RES_TD_RESBITS_MASK32                   ((uint32)0x00000000U)

    #define PMC_RES_TD_TEMP1_3_MASK32                   ((uint32)0x00000800U)
    #define PMC_RES_TD_TEMP1_2_MASK32                   ((uint32)0x00000400U)
    #define PMC_RES_TD_TEMP1_0_MASK32                   ((uint32)0x00000100U)
    #define PMC_RES_TD_TEMP0_3_MASK32                   ((uint32)0x00000008U)
    #define PMC_RES_TD_TEMP0_2_MASK32                   ((uint32)0x00000004U)
    #define PMC_RES_TD_TEMP0_0_MASK32                   ((uint32)0x00000001U)


    /****************************************************/
    /***              PMC_CTL_TD                      ***/
    /****************************************************/
    #define PMC_CTL_TD_RWBITS_MASK32                    ((uint32)0x00007F7FU)
    #define PMC_CTL_TD_RESBITS_MASK32                   ((uint32)0x00000000U)

    #define PMC_CTL_TD_TS1_TRIM_ADJ_MASK32              ((uint32)0x00007C00U)
    #define PMC_CTL_TD_TS1_DOUT_EN_MASK32               ((uint32)0x00000200U)
    #define PMC_CTL_TD_TS1_AOUT_EN_MASK32               ((uint32)0x00000100U)
    #define PMC_CTL_TD_TS0_TRIM_ADJ_MASK32              ((uint32)0x0000007CU)
    #define PMC_CTL_TD_TS0_DOUT_EN_MASK32               ((uint32)0x00000002U)
    #define PMC_CTL_TD_TS0_AOUT_EN_MASK32               ((uint32)0x00000001U)


    /****************************************************/
    /***              PMC_FIR                         ***/
    /****************************************************/

    #define PMC_FIR_STEST_FAULT_MASK32                  ((uint32)0x00000008U)
    #define PMC_FIR_TSNS_FAULT_MASK32                   ((uint32)0x00000004U)
    #define PMC_FIR_HVD_FAULT_MASK32                    ((uint32)0x00000002U)
    #define PMC_FIR_LVD_FAULT_MASK32                    ((uint32)0x00000001U)


#elif ((IPV_MC == IPV_MC_04_03_00_00) || (IPV_MC == IPV_MC_04_06_05_00))
    
    /* Analog front end Interrupt Enable Register (PMC_AFE_INTR_ENA) */
    #define PMC_AFE_INTR_ENA_ADDR32                     ((uint32)(PMC_BASEADDR + (uint32)0x0078U))
    /* Interrupt Enable Register (PMC_AFE_INTR_STATUS) */
    #define PMC_AFE_INTR_STATUS_ADDR32                  ((uint32)(PMC_BASEADDR + (uint32)0x0080U))
    /* PMC Control Register (PMC_PMCCR) */
    #define PMC_PMCCR_ADDR32                            ((uint32)(PMC_BASEADDR + (uint32)0x0094U))
    /* Temperature Sensor Interrupt Enable Register (PMC_TS_IER) */
    #define PMC_TS_IER_ADDR32                           ((uint32)(PMC_BASEADDR + (uint32)0x0098U))
    /* Temperature Sensor Event Status Registers (TS_ESR) */
    #define PMC_ESR_TD_ADDR32                           ((uint32)(PMC_BASEADDR + (uint32)0x009CU))
    /* Reset Event Enable 0 (PMC_REE_TD) */
    #define PMC_REE_TD_ADDR32                           ((uint32)(PMC_BASEADDR + (uint32)0x00A0U))
    /* Reset Event Selection 0 (PMC_RES_TD) */
    #define PMC_RES_TD_ADDR32                           ((uint32)(PMC_BASEADDR + (uint32)0x00A4U))
    /* Fault Injection Register (PMC_TS_FIR) */
    #define PMC_TS_FIR_ADDR32                           ((uint32)(PMC_BASEADDR + (uint32)0x00B4U))
    
