marshallma21/AUTOSAR_SampleProject_MPC5748G/plugins/Mcu_TS_T2D35M10I0R0/include/Reg_eSys_MC_PCU.h
    /* bit defines and masks */
    /************************************/
    /******** PMC_PMCCR_ADDR32 **********/
    /************************************/
    /* actual available bits */
    #define PMC_PMCCR_RWBITS_MASK32                     ((uint32)0xC00001DFU)
    /* user available bits */
    #define PMC_PMCCR_RWBITS_USR_MASK32                 ((uint32)0x400001DFU)
    /* bits that must be 1 */
    #define PMC_PMCCR_RESBITS_MASK32                    ((uint32)0x00000020U)
    /* PMC Enable Control */
    #define PMC_PMCCR_ENABLE_MASK32                     ((uint32)0x80000000U)
    /* Internal/External regulator Selection */
    #define PMC_PMCCR_INT_EXT_MODE_MASK32               ((uint32)0x40000000U)
    /* This bit controls the enable/disable on the LVD MIPI supply. */
    #define PMC_PMCCR_LVD_MIPI_ENABLE_MASK32             ((uint32)0x00000100U)
    /* This bit controls the enable/disable on the LVD PMC supply. */
    #define PMC_PMCCR_LVD_PMC_ENABLE_MASK32             ((uint32)0x00000080U)
    /*This bit controls the enable/disable on the LVD IO supply. */
    #define PMC_PMCCR_LVD_IO_ENABLE_MASK32              ((uint32)0x00000040U)
    /* This bit controls the enable/disable on the LVD FLASH supply. */
    /** @violates @ref Reg_eSys_MC_PCU_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define PMC_PMCCR_LVD_FLASH_ENABLE_MASK32           ((uint32)0x00000010U)
    /* This bit controls the enable/disable on the HVD ADC supply. */
    #define PMC_PMCCR_HVD_ADC_ENABLE_MASK32             ((uint32)0x00000008U)
    /* This bit controls the enable/disable on the LVD ADC supply. */
    #define PMC_PMCCR_LVD_ADC_ENABLE_MASK32             ((uint32)0x00000004U)
    /* This bit controls the enable/disable on the HVD Core supply. */
    /** @violates @ref Reg_eSys_MC_PCU_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define PMC_PMCCR_HVD_CORE_INT_ENABLE_MASK32        ((uint32)0x00000002U)
    /* LVD Core and LVD_PLL Enable Disbale control bit. */
    /** @violates @ref Reg_eSys_MC_PCU_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define PMC_PMCCR_LVD_CORE_INT_ENABLE_MASK32        ((uint32)0x00000001U)

    /************************************/
    /******** PMC_TS_IER_ADDR32 *********/
    /************************************/
    #define PMC_TS_IER_RWBITS_MASK32                    ((uint32)0x8000003FU)
    #define PMC_TS_IER_RWBITS_USR_MASK32                ((uint32)0x0000003FU)
    #define PMC_TS_IER_RESBITS_MASK32                   ((uint32)0x80000000U)
    /* Temperature Sensor interrupts Enable */
    #define PMC_TS_IER_TS_EN_MASK32                     ((uint32)0x80000000U)
    /* Temperature Sensor 1 input 3 Interrupt Enable. */
    #define PMC_TS_IER_TS1_3IE_MASK32                   ((uint32)0x00000020U)
    /* Temperature Sensor 1 input 2 Interrupt Enable. */
    #define PMC_TS_IER_TS1_2IE_MASK32                   ((uint32)0x00000010U)
    /* Temperature Sensor 1 input 0 Interrupt Enable. */
    #define PMC_TS_IER_TS1_0IE_MASK32                   ((uint32)0x00000008U)
    /* Temperature Sensor 0 input 3 Interrupt Enable. */
    #define PMC_TS_IER_TS0_3IE_MASK32                   ((uint32)0x00000004U)
    /* Temperature Sensor 0 input 2 Interrupt Enable. */
    #define PMC_TS_IER_TS0_2IE_MASK32                   ((uint32)0x00000002U)
    /* Temperature Sensor 0 input 0 Interrupt Enable. */
    #define PMC_TS_IER_TS0_0IE_MASK32                   ((uint32)0x00000001U)

    /************************************/
    /******* PMC_AFE_INTR_ENA_ADDR32 ****/
    /************************************/
    
    /* Interrupt Enable. */
    #define PMC_AFE_INTR_ENA_IE_EN_MASK32               ((uint32)0x80000000U)
    #define PMC_AFE_INTR_ENA_RESBITS_MASK32             ((uint32)0x00000000U)
    
#if (MCU_MIPI_PRESENT == STD_ON)
    #define PMC_AFE_INTR_ENA_RWBITS_MASK32              ((uint32)0x800000FFU)
    /** @violates @ref Reg_eSys_MC_PCU_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define PMC_AFE_INTR_ENA_RWBITS_USR_MASK32          ((uint32)0x000000FEU)
#else
    #define PMC_AFE_INTR_ENA_RWBITS_MASK32              ((uint32)0x8000017EU)
    /** @violates @ref Reg_eSys_MC_PCU_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define PMC_AFE_INTR_ENA_RWBITS_USR_MASK32          ((uint32)0x0000017EU)
#endif

    /* AFE-9 Interrupt Enable/Disable Control */
    /** @violates @ref Reg_eSys_MC_PCU_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define PMC_AFE_INTR_ENA_AFE_INT_EN_VREG9_MASK32    ((uint32)0x00000100U)
    /* AFE-8 Interrupt Enable/Disable Control */
    /** @violates @ref Reg_eSys_MC_PCU_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define PMC_AFE_INTR_ENA_AFE_INT_EN_VREG8_MASK32    ((uint32)0x00000080U)
    /* AFE-7 Interrupt Enable/Disable Control */
    /** @violates @ref Reg_eSys_MC_PCU_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define PMC_AFE_INTR_ENA_AFE_INT_EN_VREG7_MASK32    ((uint32)0x00000040U)
    /* AFE-6 Interrupt Enable/Disable Control */
    /** @violates @ref Reg_eSys_MC_PCU_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define PMC_AFE_INTR_ENA_AFE_INT_EN_VREG6_MASK32    ((uint32)0x00000020U)
    /* AFE-5 Interrupt Enable/Disable Control */
    /** @violates @ref Reg_eSys_MC_PCU_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define PMC_AFE_INTR_ENA_AFE_INT_EN_VREG5_MASK32    ((uint32)0x00000010U)
    /* AFE-4 Interrupt Enable/Disable Control */
    /** @violates @ref Reg_eSys_MC_PCU_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define PMC_AFE_INTR_ENA_AFE_INT_EN_VREG4_MASK32    ((uint32)0x00000008U)
    /* AFE-3 Interrupt Enable/Disable Control */
    /** @violates @ref Reg_eSys_MC_PCU_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define PMC_AFE_INTR_ENA_AFE_INT_EN_VREG3_MASK32    ((uint32)0x00000004U)
    /* AFE-2 Interrupt Enable/Disable Control */
    /** @violates @ref Reg_eSys_MC_PCU_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define PMC_AFE_INTR_ENA_AFE_INT_EN_VREG2_MASK32    ((uint32)0x00000002U)
    /* AFE-1 Interrupt Enable/Disable Control */
    /** @violates @ref Reg_eSys_MC_PCU_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define PMC_AFE_INTR_ENA_AFE_INT_EN_VREG1_MASK32    ((uint32)0x00000001U)
    
