marshallma21/AUTOSAR_SampleProject_MPC5748G/plugins/Mcu_TS_T2D35M10I0R0/include/Reg_eSys_MC_PCU.h
    /************************************/
    /***** PMC_AFE_INTR_STATUS_ADDR32 ***/
    /************************************/
    #define PMC_AFE_INTR_STATUS_MASK32                  ((uint32)0x000001FFU)

    /************************************/
    /********* PMC_REE_TD_ADDR32 *********/
    /************************************/
    #define PMC_REE_TD_RWBITS_MASK32                    ((uint32)0x0000003FU)
    #define PMC_REE_TD_RESBITS_MASK32                   ((uint32)0x00000000U)
    
    #define PMC_REE_TD_TEMP1_3_MASK32                   ((uint32)0x00000020U)
    #define PMC_REE_TD_TEMP1_2_MASK32                   ((uint32)0x00000010U)
    #define PMC_REE_TD_TEMP1_0_MASK32                   ((uint32)0x00000008U)
    #define PMC_REE_TD_TEMP0_3_MASK32                   ((uint32)0x00000004U)
    #define PMC_REE_TD_TEMP0_2_MASK32                   ((uint32)0x00000002U)
    #define PMC_REE_TD_TEMP0_0_MASK32                   ((uint32)0x00000001U)

    /****************************************************/
    /***              PMC_RES_TD                      ***/
    /****************************************************/
    #define PMC_RES_TD_RWBITS_MASK32                    ((uint32)0x0000003FU)
    #define PMC_RES_TD_RESBITS_MASK32                   ((uint32)0x00000000U)

    #define PMC_RES_TD_TEMP1_3_MASK32                   ((uint32)0x00000020U)
    #define PMC_RES_TD_TEMP1_2_MASK32                   ((uint32)0x00000010U)
    #define PMC_RES_TD_TEMP1_0_MASK32                   ((uint32)0x00000008U)
    #define PMC_RES_TD_TEMP0_3_MASK32                   ((uint32)0x00000004U)
    #define PMC_RES_TD_TEMP0_2_MASK32                   ((uint32)0x00000002U)
    #define PMC_RES_TD_TEMP0_0_MASK32                   ((uint32)0x00000001U)

    /************************************/
    /******** PMC_TS_FIR_ADDR32 **********/
    /************************************/
    /* actual available bits */
    #define  PMC_TS_FIR_TSNS_FAULT_MASK32               ((uint32)0x00000001U)

    /************************************/
    /********* PMC_ESR_TD_ADDR32 ********/
    /************************************/
    #define PMC_ESR_TD_MASK32                           ((uint32)0x0000003FU)

#elif ( IPV_MC == IPV_MC_04_00_15_15 )
    /* Supply Gauge Status Register (GR_S) */
    #define PMC_GR_S_ADDR32                             ((uint32)(PMC_BASEADDR + (uint32)0x0000U))
    /* Pending Gauge Status Register (GR_P) */
    #define PMC_GR_P_ADDR32                             ((uint32)(PMC_BASEADDR + (uint32)0x0004U))
    /* Interrupt Enable Pending Register (IE_P) */
    #define PMC_IER_ADDR32                              ((uint32)(PMC_BASEADDR + (uint32)0x0008U))
    /* LVD280 Event Pending register VD3 (EPR_VD3) */
    #define PMC_EPR_VD3_ADDR32                          ((uint32)(PMC_BASEADDR + (uint32)0x0030U))
    /* Reset Event Enable VD3 (REE_VD3) */
    #define PMC_REE_VD3_ADDR32                          ((uint32)(PMC_BASEADDR + (uint32)0x0034U))
    /* Reset Event Selection VD3 (RES_VD3) */
    #define PMC_RES_VD3_ADDR32                          ((uint32)(PMC_BASEADDR + (uint32)0x0038U))
    /* FCCU Event Enable VD3 (FEE_VD3) */
    #define PMC_FEE_VD3_ADDR32                          ((uint32)(PMC_BASEADDR + (uint32)0x003CU))
    /* LVD280 Event Pending register VD4 (EPR_VD4) */
    #define PMC_EPR_VD4_ADDR32                          ((uint32)(PMC_BASEADDR + (uint32)0x0040U))
    /* Reset Event Enable VD3 (REE_VD4) */
    #define PMC_REE_VD4_ADDR32                          ((uint32)(PMC_BASEADDR + (uint32)0x0044U))
    /* Reset Event Selection VD3 (RES_VD4) */
    #define PMC_RES_VD4_ADDR32                          ((uint32)(PMC_BASEADDR + (uint32)0x0048U))
    /* FCCU Event Enable VD3 (FEE_VD4) */
    #define PMC_FEE_VD4_ADDR32                          ((uint32)(PMC_BASEADDR + (uint32)0x004CU))
    /* LVD280 Event Pending register VD7 (EPR_VD7) */
    #define PMC_EPR_VD7_ADDR32                          ((uint32)(PMC_BASEADDR + (uint32)0x0070U))
    /* Reset Event Enable VD3 (REE_VD7) */
    #define PMC_REE_VD7_ADDR32                          ((uint32)(PMC_BASEADDR + (uint32)0x0074U))
    /* Reset Event Selection VD3 (RES_VD7) */
    #define PMC_RES_VD7_ADDR32                          ((uint32)(PMC_BASEADDR + (uint32)0x0078U))
    /* FCCU Event Enable VD3 (FEE_VD7) */
    #define PMC_FEE_VD7_ADDR32                          ((uint32)(PMC_BASEADDR + (uint32)0x007CU))
    /* LVD280 Event Pending register VD8 (EPR_VD8) */
    #define PMC_EPR_VD8_ADDR32                          ((uint32)(PMC_BASEADDR + (uint32)0x0080U))
    /* Reset Event Enable VD3 (REE_VD8) */
    #define PMC_REE_VD8_ADDR32                          ((uint32)(PMC_BASEADDR + (uint32)0x0084U))
    /* Reset Event Selection VD3 (RES_VD8) */
    #define PMC_RES_VD8_ADDR32                          ((uint32)(PMC_BASEADDR + (uint32)0x0088U))
    /* FCCU Event Enable VD3 (FEE_VD8) */
    #define PMC_FEE_VD8_ADDR32                          ((uint32)(PMC_BASEADDR + (uint32)0x008CU))
    /* LVD280 Event Pending register VD9 (EPR_VD9) */
    #define PMC_EPR_VD9_ADDR32                          ((uint32)(PMC_BASEADDR + (uint32)0x0090U))
    /* Reset Event Enable VD9 (REE_VD9) */
    #define PMC_REE_VD9_ADDR32                          ((uint32)(PMC_BASEADDR + (uint32)0x0094U))
    /* Reset Event Selection VD9 (RES_VD9) */
    #define PMC_RES_VD9_ADDR32                          ((uint32)(PMC_BASEADDR + (uint32)0x0098U))
    /* FCCU Event Enable VD3 (FEE_VD9) */
    #define PMC_FEE_VD9_ADDR32                          ((uint32)(PMC_BASEADDR + (uint32)0x009CU))
    /* LVD280 Event Pending register VD10 (EPR_VD10) */
    #define PMC_EPR_VD10_ADDR32                         ((uint32)(PMC_BASEADDR + (uint32)0x00A0U))
    /* Reset Event Enable VD10 (REE_VD10) */
    #define PMC_REE_VD10_ADDR32                         ((uint32)(PMC_BASEADDR + (uint32)0x00A4U))
    /* FCCU Event Enable VD10 (FEE_VD10) */
    #define PMC_FEE_VD10_ADDR32                         ((uint32)(PMC_BASEADDR + (uint32)0x00ACU))
    /* LVD280 Event Pending register VD12 (EPR_VD12) */
    #define PMC_EPR_VD12_ADDR32                         ((uint32)(PMC_BASEADDR + (uint32)0x00C0U))
    /* Reset Event Enable VD12 (REE_VD12) */
    #define PMC_REE_VD12_ADDR32                         ((uint32)(PMC_BASEADDR + (uint32)0x00C4U))
    /* Reset Event Selection VD12 (RES_VD12) */
    #define PMC_RES_VD12_ADDR32                         ((uint32)(PMC_BASEADDR + (uint32)0x00C8U))
    /* FCCU Event Enable VD12 (FEE_VD12) */
    #define PMC_FEE_VD12_ADDR32                         ((uint32)(PMC_BASEADDR + (uint32)0x00CCU))
    /* LVD280 Event Pending register VD13 (EPR_VD13) */
    #define PMC_EPR_VD13_ADDR32                         ((uint32)(PMC_BASEADDR + (uint32)0x00D0U))
    /* Reset Event Enable VD13 (REE_VD13) */
    #define PMC_REE_VD13_ADDR32                         ((uint32)(PMC_BASEADDR + (uint32)0x00D4U))
    /* Reset Event Selection VD13 (RES_VD13) */
    #define PMC_RES_VD13_ADDR32                         ((uint32)(PMC_BASEADDR + (uint32)0x00D8U))
    /* FCCU Event Enable VD13 (FEE_VD13) */
    #define PMC_FEE_VD13_ADDR32                         ((uint32)(PMC_BASEADDR + (uint32)0x00DCU))
    /* LVD280 Event Pending register VD14 (EPR_VD14) */
    #define PMC_EPR_VD14_ADDR32                         ((uint32)(PMC_BASEADDR + (uint32)0x00E0U))
    /* Reset Event Enable VD14 (REE_VD14) */
    #define PMC_REE_VD14_ADDR32                         ((uint32)(PMC_BASEADDR + (uint32)0x00E4U))
    /* Reset Event Selection VD14 (RES_VD14) */
    #define PMC_RES_VD14_ADDR32                         ((uint32)(PMC_BASEADDR + (uint32)0x00E8U))
    /* FCCU Event Enable VD14 (FEE_VD14) */
    #define PMC_FEE_VD14_ADDR32                         ((uint32)(PMC_BASEADDR + (uint32)0x00ECU))
    /* LVD280 Event Pending register VD15 (EPR_VD15) */
    #define PMC_EPR_VD15_ADDR32                         ((uint32)(PMC_BASEADDR + (uint32)0x00F0U))
    /* Reset Event Enable VD15 (REE_VD15) */
    #define PMC_REE_VD15_ADDR32                         ((uint32)(PMC_BASEADDR + (uint32)0x00F4U))
    /* Reset Event Selection VD15 (RES_VD15) */
    #define PMC_RES_VD15_ADDR32                         ((uint32)(PMC_BASEADDR + (uint32)0x00F8U))
    /* FCCU Event Enable VD15 (FEE_VD15) */
    #define PMC_FEE_VD15_ADDR32                         ((uint32)(PMC_BASEADDR + (uint32)0x00FCU))
    /* Voltage Supply for I/O Segments Register (VSIO) */
    #define PMC_VSIO_ADDR32                             ((uint32)(PMC_BASEADDR + (uint32)0x0104U))
    /* Temperature Event Pending register (EPR_TD) */
    #define PMC_EPR_TD_ADDR32                           ((uint32)(PMC_BASEADDR + (uint32)0x0300U))
    /* Temperature Reset Event Enable register (REE_TD) */
    #define PMC_REE_TD_ADDR32                           ((uint32)(PMC_BASEADDR + (uint32)0x0304U))
    /* Temperature Reset Event Selection register (RES_TD) */
    #define PMC_RES_TD_ADDR32                           ((uint32)(PMC_BASEADDR + (uint32)0x0308U))
    /* Temperature detector configuration register (CTL_TD) */
    #define PMC_CTL_TD_ADDR32                           ((uint32)(PMC_BASEADDR + (uint32)0x030CU))
    /* Temperature FCCU Event Enable register (FEE_TD) */
    #define PMC_FEE_TD_ADDR32                           ((uint32)(PMC_BASEADDR + (uint32)0x0318U))


