marshallma21/AUTOSAR_SampleProject_MPC5748G/plugins/Mcu_TS_T2D35M10I0R0/include/Reg_eSys_MC_PCU.h
    /****************************************************/
    /***               (GR_S)                         ***/
    /****************************************************/
    #define PMC_GR_S_RWBITS_MASK32                      ((uint32)0x00000000U)
    #define PMC_GR_S_RESBITS_MASK32                     ((uint32)0x00000000U)
    #define PMC_GR_S_VD15_MASK32                        ((uint32)0x00008000U)
    #define PMC_GR_S_VD14_MASK32                        ((uint32)0x00004000U)
    #define PMC_GR_S_VD13_MASK32                        ((uint32)0x00002000U)
    #define PMC_GR_S_VD12_MASK32                        ((uint32)0x00001000U)
    #define PMC_GR_S_VD10_MASK32                        ((uint32)0x00000400U)
    #define PMC_GR_S_VD9_MASK32                         ((uint32)0x00000200U)
    #define PMC_GR_S_VD8_MASK32                         ((uint32)0x00000100U)
    #define PMC_GR_S_VD7_MASK32                         ((uint32)0x00000080U)
    #define PMC_GR_S_VD4_MASK32                         ((uint32)0x00000010U)
    #define PMC_GR_S_VD3_MASK32                         ((uint32)0x00000008U)

    /****************************************************/
    /***               (GR_P)                         ***/
    /****************************************************/
    #define PMC_GR_P_RWBITS_MASK32                      ((uint32)0x00000000U)
    #define PMC_GR_P_RESBITS_MASK32                     ((uint32)0x00000000U)
    #define PMC_GR_P_VD15_A_MASK32                      ((uint32)0x02000000U)
    #define PMC_GR_P_VD15_C_MASK32                      ((uint32)0x01000000U)
    #define PMC_GR_P_VD14_A_MASK32                      ((uint32)0x00400000U)
    #define PMC_GR_P_VD14_IM_MASK32                     ((uint32)0x00200000U)
    #define PMC_GR_P_VD13_IM_MASK32                     ((uint32)0x00040000U)
    #define PMC_GR_P_VD12_F_MASK32                      ((uint32)0x00020000U)
    #define PMC_GR_P_VD10_A_MASK32                      ((uint32)0x00010000U)
    #define PMC_GR_P_VD10_F_MASK32                      ((uint32)0x00008000U)
    #define PMC_GR_P_VD9_O_MASK32                       ((uint32)0x00004000U)
    #define PMC_GR_P_VD9_IF2_MASK32                     ((uint32)0x00002000U)
    #define PMC_GR_P_VD9_IF_MASK32                      ((uint32)0x00001000U)
    #define PMC_GR_P_VD9_IJ_MASK32                      ((uint32)0x00000800U)
    #define PMC_GR_P_VD9_IM_MASK32                      ((uint32)0x00000400U)
    #define PMC_GR_P_VD9_F_MASK32                       ((uint32)0x00000200U)
    #define PMC_GR_P_VD9_EBI_MASK32                     ((uint32)0x00000100U)
    #define PMC_GR_P_VD9_C_MASK32                       ((uint32)0x00000080U)
    #define PMC_GR_P_VD8_C_MASK32                       ((uint32)0x00000040U)
    #define PMC_GR_P_VD8_F_MASK32                       ((uint32)0x00000020U)
    #define PMC_GR_P_VD7_C_MASK32                       ((uint32)0x00000010U)
    #define PMC_GR_P_VD4_C_MASK32                       ((uint32)0x00000008U)
    #define PMC_GR_P_VD3_P_MASK32                       ((uint32)0x00000004U)
    #define PMC_GR_P_VD3_F_MASK32                       ((uint32)0x00000002U)
    #define PMC_GR_P_VD3_C_MASK32                       ((uint32)0x00000001U)

    /****************************************************/
    /***               (IE_P)                         ***/
    /****************************************************/
    #define PMC_IER_RWBITS_MASK32                       ((uint32)0x8367FFFFU)
    #define PMC_IER_RESBITS_MASK32                      ((uint32)0x00000000U)
    #define PMC_IER_IE_EN_MASK32                        ((uint32)0x80000000U)
    #define PMC_IER_VD15IE_A_MASK32                     ((uint32)0x02000000U)
    #define PMC_IER_VD15IE_C_MASK32                     ((uint32)0x01000000U)
    #define PMC_IER_VD14IE_A_MASK32                     ((uint32)0x00400000U)
    #define PMC_IER_VD14IE_IM_MASK32                    ((uint32)0x00200000U)
    #define PMC_IER_VD13IE_IM_MASK32                    ((uint32)0x00040000U)
    #define PMC_IER_VD12IE_F_MASK32                     ((uint32)0x00020000U)
    #define PMC_IER_VD10IE_A_MASK32                     ((uint32)0x00010000U)
    #define PMC_IER_VD10IE_F_MASK32                     ((uint32)0x00008000U)
    #define PMC_IER_VD9IE_O_MASK32                      ((uint32)0x00004000U)
    #define PMC_IER_VD9IE_IF2_MASK32                    ((uint32)0x00002000U)
    #define PMC_IER_VD9IE_IF_MASK32                     ((uint32)0x00001000U)
    #define PMC_IER_VD9IE_IJ_MASK32                     ((uint32)0x00000800U)
    #define PMC_IER_VD9IE_IM_MASK32                     ((uint32)0x00000400U)
    #define PMC_IER_VD9IE_F_MASK32                      ((uint32)0x00000200U)
    #define PMC_IER_VD9IE_EBI_MASK32                    ((uint32)0x00000100U)
    #define PMC_IER_VD9IE_C_MASK32                      ((uint32)0x00000080U)
    #define PMC_IER_VD8IE_F_MASK32                      ((uint32)0x00000040U)
    #define PMC_IER_VD8IE_C_MASK32                      ((uint32)0x00000020U)
    #define PMC_IER_VD7IE_C_MASK32                      ((uint32)0x00000010U)
    #define PMC_IER_VD4IE_C_MASK32                      ((uint32)0x00000008U)
    #define PMC_IER_VD3IE_P_MASK32                      ((uint32)0x00000004U)
    #define PMC_IER_VD3IE_F_MASK32                      ((uint32)0x00000002U)
    #define PMC_IER_VD3IE_C_MASK32                      ((uint32)0x00000001U)

    #define PMC_IER_VD3IE_MASK32                        ((uint32)0x00000007U)
    #define PMC_IER_VD4IE_MASK32                        ((uint32)0x00000008U)
    #define PMC_IER_VD7IE_MASK32                        ((uint32)0x00000010U)
    #define PMC_IER_VD8IE_MASK32                        ((uint32)0x00000060U)
    #define PMC_IER_VD9IE_MASK32                        ((uint32)0x00007F80U)
    #define PMC_IER_VD10IE_MASK32                       ((uint32)0x00018000U)
    #define PMC_IER_VD12IE_MASK32                       ((uint32)0x00020000U)
    #define PMC_IER_VD13IE_MASK32                       ((uint32)0x00040000U)
    #define PMC_IER_VD14IE_MASK32                       ((uint32)0x00600000U)
    #define PMC_IER_VD15IE_MASK32                       ((uint32)0x03000000U)

