marshallma21/AUTOSAR_SampleProject_MPC5748G/plugins/Mcu_TS_T2D35M10I0R0/include/Reg_eSys_MC_PCU.h
    /****************************************************/
    /***               (EPR_VD3)                      ***/
    /****************************************************/
    #define PMC_EPR_VD3_RWBITS_MASK32                   ((uint32)0x000000C1U)
    #define PMC_EPR_VD3_RESBITS_MASK32                  ((uint32)0x00000000U)
    #define PMC_EPR_VD3_LVD3_P_MASK32                   ((uint32)0x00000080U)
    #define PMC_EPR_VD3_LVD3_F_MASK32                   ((uint32)0x00000040U)
    #define PMC_EPR_VD3_LVD3_C_MASK32                   ((uint32)0x00000001U)

    /****************************************************/
    /***               (REE_VD3)                      ***/
    /****************************************************/
    #define PMC_REE_VD3_RWBITS_MASK32                   ((uint32)0x000000C1U)
    #define PMC_REE_VD3_RESBITS_MASK32                  ((uint32)0x00000000U)
    #define PMC_REE_VD3_LVD3_P_MASK32                   ((uint32)0x00000080U)
    #define PMC_REE_VD3_LVD3_F_MASK32                   ((uint32)0x00000040U)
    #define PMC_REE_VD3_LVD3_C_MASK32                   ((uint32)0x00000001U)

    /****************************************************/
    /***               (RES_VD3)                      ***/
    /****************************************************/
    #define PMC_RES_VD3_RWBITS_MASK32                   ((uint32)0x000000C1U)
    #define PMC_RES_VD3_RESBITS_MASK32                  ((uint32)0x00000000U)
    #define PMC_RES_VD3_LVD3_P_MASK32                   ((uint32)0x00000080U)
    #define PMC_RES_VD3_LVD3_F_MASK32                   ((uint32)0x00000040U)
    #define PMC_RES_VD3_LVD3_C_MASK32                   ((uint32)0x00000001U)

    /****************************************************/
    /***               (FEE_VD3)                      ***/
    /****************************************************/
    #define PMC_FEE_VD3_RWBITS_MASK32                   ((uint32)0x000000C1U)
    #define PMC_FEE_VD3_RESBITS_MASK32                  ((uint32)0x00000000U)
    #define PMC_FEE_VD3_FEE3_P_MASK32                   ((uint32)0x00000080U)
    #define PMC_FEE_VD3_FEE3_F_MASK32                   ((uint32)0x00000040U)
    #define PMC_FEE_VD3_FEE3_C_MASK32                   ((uint32)0x00000001U)

    /****************************************************/
    /***               (EPR_VD4)                      ***/
    /****************************************************/
    #define PMC_EPR_VD4_RWBITS_MASK32                   ((uint32)0x00000001U)
    #define PMC_EPR_VD4_RESBITS_MASK32                  ((uint32)0x00000000U)
    #define PMC_EPR_VD4_LVD4_C_MASK32                   ((uint32)0x00000001U)

    /****************************************************/
    /***               (REE_VD4)                      ***/
    /****************************************************/
    #define PMC_REE_VD4_RWBITS_MASK32                   ((uint32)0x00000001U)
    #define PMC_REE_VD4_RESBITS_MASK32                  ((uint32)0x00000000U)
    #define PMC_REE_VD4_LVD4_C_MASK32                   ((uint32)0x00000001U)

    /****************************************************/
    /***               (RES_VD4)                      ***/
    /****************************************************/
    #define PMC_RES_VD4_RWBITS_MASK32                   ((uint32)0x00000001U)
    #define PMC_RES_VD4_RESBITS_MASK32                  ((uint32)0x00000000U)
    #define PMC_RES_VD4_LVD4_C_MASK32                   ((uint32)0x00000001U)

    /****************************************************/
    /***               (FEE_VD4)                      ***/
    /****************************************************/
    #define PMC_FEE_VD4_RWBITS_MASK32                   ((uint32)0x00000001U)
    #define PMC_FEE_VD4_RESBITS_MASK32                  ((uint32)0x00000000U)
    #define PMC_FEE_VD4_FEE4_C_MASK32                   ((uint32)0x00000001U)

    /****************************************************/
    /***               (EPR_VD7)                      ***/
    /****************************************************/
    #define PMC_EPR_VD7_RWBITS_MASK32                   ((uint32)0x00000001U)
    #define PMC_EPR_VD7_RESBITS_MASK32                  ((uint32)0x00000000U)
    #define PMC_EPR_VD7_HVD7_C_MASK32                   ((uint32)0x00000001U)

    /****************************************************/
    /***               (REE_VD7)                      ***/
    /****************************************************/
    #define PMC_REE_VD7_RWBITS_MASK32                   ((uint32)0x00000001U)
    #define PMC_REE_VD7_RESBITS_MASK32                  ((uint32)0x00000000U)
    #define PMC_REE_VD7_HVD7_C_MASK32                   ((uint32)0x00000001U)

    /****************************************************/
    /***               (RES_VD7)                      ***/
    /****************************************************/
    #define PMC_RES_VD7_RWBITS_MASK32                   ((uint32)0x00000001U)
    #define PMC_RES_VD7_RESBITS_MASK32                  ((uint32)0x00000000U)
    #define PMC_RES_VD7_HVD7_C_MASK32                   ((uint32)0x00000001U)

    /****************************************************/
    /***               (FEE_VD7)                      ***/
    /****************************************************/
    #define PMC_FEE_VD7_RWBITS_MASK32                   ((uint32)0x00000001U)
    #define PMC_FEE_VD7_RESBITS_MASK32                  ((uint32)0x00000000U)
    #define PMC_FEE_VD7_FEE7_C_MASK32                   ((uint32)0x00000001U)

    /****************************************************/
    /***               (EPR_VD8)                      ***/
    /****************************************************/
    #define PMC_EPR_VD8_RWBITS_MASK32                   ((uint32)0x00000041U)
    #define PMC_EPR_VD8_RESBITS_MASK32                  ((uint32)0x00000000U)
    #define PMC_EPR_VD8_HVD8_F_MASK32                   ((uint32)0x00000040U)
    #define PMC_EPR_VD8_HVD8_C_MASK32                   ((uint32)0x00000001U)

