marshallma21/AUTOSAR_SampleProject_MPC5748G/plugins/Mcu_TS_T2D35M10I0R0/include/Reg_eSys_MC_PCU.h
    /****************************************************/
    /***               (RES_VD8)                      ***/
    /****************************************************/
    #define PMC_RES_VD8_RWBITS_MASK32                   ((uint32)0x00000041U)
    #define PMC_RES_VD8_RESBITS_MASK32                  ((uint32)0x00000000U)
    #define PMC_RES_VD8_HVD8_F_MASK32                   ((uint32)0x00000040U)
    #define PMC_RES_VD8_HVD8_C_MASK32                   ((uint32)0x00000001U)

    /****************************************************/
    /***               (FEE_VD8)                      ***/
    /****************************************************/
    #define PMC_FEE_VD8_RWBITS_MASK32                   ((uint32)0x00000041U)
    #define PMC_FEE_VD8_RESBITS_MASK32                  ((uint32)0x00000000U)
    #define PMC_FEE_VD8_FEE8_F_MASK32                   ((uint32)0x00000040U)
    #define PMC_FEE_VD8_FEE8_C_MASK32                   ((uint32)0x00000001U)


    /****************************************************/
    /***               (EPR_VD9)                      ***/
    /****************************************************/
    #define PMC_EPR_VD9_RWBITS_MASK32                   ((uint32)0x00004741U)
    #define PMC_EPR_VD9_RESBITS_MASK32                  ((uint32)0x00000000U)
    #define PMC_EPR_VD9_LVD9_O_MASK32                   ((uint32)0x00004000U)
    #define PMC_EPR_VD9_LVD9_IF_MASK32                  ((uint32)0x00000400U)
    #define PMC_EPR_VD9_LVD9_IJ_MASK32                  ((uint32)0x00000200U)
    #define PMC_EPR_VD9_LVD9_IM_MASK32                  ((uint32)0x00000100U)
    #define PMC_EPR_VD9_LVD9_F_MASK32                   ((uint32)0x00000040U)
    #define PMC_EPR_VD9_LVD9_C_MASK32                   ((uint32)0x00000001U)

    /****************************************************/
    /***               (REE_VD9)                      ***/
    /****************************************************/
    #define PMC_REE_VD9_RWBITS_MASK32                   ((uint32)0x00004741U)
    #define PMC_REE_VD9_RESBITS_MASK32                  ((uint32)0x00000000U)
    #define PMC_REE_VD9_LVD9_O_MASK32                   ((uint32)0x00004000U)
    #define PMC_REE_VD9_LVD9_IF_MASK32                  ((uint32)0x00000400U)
    #define PMC_REE_VD9_LVD9_IJ_MASK32                  ((uint32)0x00000200U)
    #define PMC_REE_VD9_LVD9_IM_MASK32                  ((uint32)0x00000100U)
    #define PMC_REE_VD9_LVD9_F_MASK32                   ((uint32)0x00000040U)
    #define PMC_REE_VD9_LVD9_C_MASK32                   ((uint32)0x00000001U)

    /****************************************************/
    /***               (RES_VD9)                      ***/
    /****************************************************/
    #define PMC_RES_VD9_RWBITS_MASK32                   ((uint32)0x00000400U)
    #define PMC_RES_VD9_RESBITS_MASK32                  ((uint32)0x00000000U)
    #define PMC_RES_VD9_LVD9_IF_MASK32                  ((uint32)0x00000400U)

    /****************************************************/
    /***               (FEE_VD9)                      ***/
    /****************************************************/
    #define PMC_FEE_VD9_RWBITS_MASK32                   ((uint32)0x00004741U)
    #define PMC_FEE_VD9_RESBITS_MASK32                  ((uint32)0x00000000U)
    #define PMC_FEE_VD9_FEE9_O_MASK32                   ((uint32)0x00004000U)
    #define PMC_FEE_VD9_FEE9_IF_MASK32                  ((uint32)0x00000400U)
    #define PMC_FEE_VD9_FEE9_IJ_MASK32                  ((uint32)0x00000200U)
    #define PMC_FEE_VD9_FEE9_IM_MASK32                  ((uint32)0x00000100U)
    #define PMC_FEE_VD9_FEE9_F_MASK32                   ((uint32)0x00000040U)
    #define PMC_FEE_VD9_FEE9_C_MASK32                   ((uint32)0x00000001U)

    /****************************************************/
    /***               (EPR_VD10)                     ***/
    /****************************************************/
    #define PMC_EPR_VD10_RWBITS_MASK32                  ((uint32)0x00008040U)
    #define PMC_EPR_VD10_RESBITS_MASK32                 ((uint32)0x00000000U)
    #define PMC_EPR_VD10_LVD10_A_MASK32                 ((uint32)0x00008000U)
    #define PMC_EPR_VD10_LVD10_F_MASK32                 ((uint32)0x00000040U)

    /****************************************************/
    /***               (REE_VD10)                      ***/
    /****************************************************/
    #define PMC_REE_VD10_RWBITS_MASK32                  ((uint32)0x00008040U)
    #define PMC_REE_VD10_RESBITS_MASK32                 ((uint32)0x00000000U)
    #define PMC_REE_VD10_LVD10_A_MASK32                 ((uint32)0x00008000U)
    #define PMC_REE_VD10_LVD10_F_MASK32                 ((uint32)0x00000040U)

    /****************************************************/
    /***               (FEE_VD10)                     ***/
    /****************************************************/
    #define PMC_FEE_VD10_RWBITS_MASK32                  ((uint32)0x00008040U)
    #define PMC_FEE_VD10_RESBITS_MASK32                 ((uint32)0x00000000U)
    #define PMC_FEE_VD10_FEE10_A_MASK32                 ((uint32)0x00008000U)
    #define PMC_FEE_VD10_FEE10_F_MASK32                 ((uint32)0x00000040U)

    /****************************************************/
    /***               (EPR_VD12)                      ***/
    /****************************************************/
    #define PMC_EPR_VD12_RWBITS_MASK32                  ((uint32)0x00000040U)
    #define PMC_EPR_VD12_RESBITS_MASK32                 ((uint32)0x00000000U)
    #define PMC_EPR_VD12_HVD12_F_MASK32                 ((uint32)0x00000040U)

    /****************************************************/
    /***               (REE_VD12)                     ***/
    /****************************************************/
    #define PMC_REE_VD12_RWBITS_MASK32                  ((uint32)0x00000040U)
    #define PMC_REE_VD12_RESBITS_MASK32                 ((uint32)0x00000000U)
    #define PMC_REE_VD12_HVD12_F_MASK32                 ((uint32)0x00000040U)


