marshallma21/AUTOSAR_SampleProject_MPC5748G/plugins/Mcu_TS_T2D35M10I0R0/include/Reg_eSys_MC_PCU.h
    /****************************************************/
    /***               (RES_VD12)                     ***/
    /****************************************************/
    #define PMC_RES_VD12_RWBITS_MASK32                  ((uint32)0x00000040U)
    #define PMC_RES_VD12_RESBITS_MASK32                 ((uint32)0x00000000U)
    #define PMC_RES_VD12_HVD12_F_MASK32                 ((uint32)0x00000040U)

    /****************************************************/
    /***               (FEE_VD12)                     ***/
    /****************************************************/
    #define PMC_FEE_VD12_RWBITS_MASK32                  ((uint32)0x00000040U)
    #define PMC_FEE_VD12_RESBITS_MASK32                 ((uint32)0x00000000U)
    #define PMC_FEE_VD12_FEE12_F_MASK32                 ((uint32)0x00000040U)

    /****************************************************/
    /***               (EPR_VD13)                     ***/
    /****************************************************/
    #define PMC_EPR_VD13_RWBITS_MASK32                  ((uint32)0x00000100U)
    #define PMC_EPR_VD13_RESBITS_MASK32                 ((uint32)0x00000000U)
    #define PMC_EPR_VD13_LVD13_IM_MASK32                ((uint32)0x00000100U)

    /****************************************************/
    /***               (REE_VD13)                     ***/
    /****************************************************/
    #define PMC_REE_VD13_RWBITS_MASK32                  ((uint32)0x00000100U)
    #define PMC_REE_VD13_RESBITS_MASK32                 ((uint32)0x00000000U)
    #define PMC_REE_VD13_LVD13_IM_MASK32                ((uint32)0x00000100U)

    /****************************************************/
    /***               (RES_VD13)                     ***/
    /****************************************************/
    #define PMC_RES_VD13_RWBITS_MASK32                  ((uint32)0x00000100U)
    #define PMC_RES_VD13_RESBITS_MASK32                 ((uint32)0x00000000U)
    #define PMC_RES_VD13_LVD13_IM_MASK32                ((uint32)0x00000100U)

    /****************************************************/
    /***               (FEE_VD13)                     ***/
    /****************************************************/
    #define PMC_FEE_VD13_RWBITS_MASK32                  ((uint32)0x00000100U)
    #define PMC_FEE_VD13_RESBITS_MASK32                 ((uint32)0x00000000U)
    #define PMC_FEE_VD13_FEE13_IM_MASK32                ((uint32)0x00000100U)

    /****************************************************/
    /***               (EPR_VD14)                     ***/
    /****************************************************/
    #define PMC_EPR_VD14_RWBITS_MASK32                  ((uint32)0x00008100U)
    #define PMC_EPR_VD14_RESBITS_MASK32                 ((uint32)0x00000000U)
    #define PMC_EPR_VD14_LVD14_A_MASK32                 ((uint32)0x00008000U)
    #define PMC_EPR_VD14_LVD14_IM_MASK32                ((uint32)0x00000100U)

    /****************************************************/
    /***               (REE_VD14)                     ***/
    /****************************************************/
    #define PMC_REE_VD14_RWBITS_MASK32                  ((uint32)0x00008100U)
    #define PMC_REE_VD14_RESBITS_MASK32                 ((uint32)0x00000000U)
    #define PMC_REE_VD14_LVD14_A_MASK32                 ((uint32)0x00008000U)
    #define PMC_REE_VD14_LVD14_IM_MASK32                ((uint32)0x00000100U)

    /****************************************************/
    /***               (RES_VD14)                     ***/
    /****************************************************/
    #define PMC_RES_VD14_RWBITS_MASK32                  ((uint32)0x00008100U)
    #define PMC_RES_VD14_RESBITS_MASK32                 ((uint32)0x00000000U)
    #define PMC_RES_VD14_LVD14_A_MASK32                 ((uint32)0x00008000U)
    #define PMC_RES_VD14_LVD14_IM_MASK32                ((uint32)0x00000100U)

    /****************************************************/
    /***               (FEE_VD14)                     ***/
    /****************************************************/
    #define PMC_FEE_VD14_RWBITS_MASK32                  ((uint32)0x00008100U)
    #define PMC_FEE_VD14_RESBITS_MASK32                 ((uint32)0x00000000U)
    #define PMC_FEE_VD14_FEE14_A_MASK32                 ((uint32)0x00008000U)
    #define PMC_FEE_VD14_FEE14_IM_MASK32                ((uint32)0x00000100U)

    /****************************************************/
    /***               (EPR_VD15)                      ***/
    /****************************************************/
    #define PMC_EPR_VD15_RWBITS_MASK32                  ((uint32)0x00008001U)
    #define PMC_EPR_VD15_RESBITS_MASK32                 ((uint32)0x00000000U)
    #define PMC_EPR_VD15_HVD15_A_MASK32                 ((uint32)0x00008000U)
    #define PMC_EPR_VD15_HVD15_C_MASK32                 ((uint32)0x00000001U)

    /****************************************************/
    /***               (REE_VD15)                     ***/
    /****************************************************/
    #define PMC_REE_VD15_RWBITS_MASK32                  ((uint32)0x00008001U)
    #define PMC_REE_VD15_RESBITS_MASK32                 ((uint32)0x00000000U)
    #define PMC_REE_VD15_HVD15_A_MASK32                 ((uint32)0x00008000U)
    #define PMC_REE_VD15_HVD15_C_MASK32                 ((uint32)0x00000001U)

    /****************************************************/
    /***               (RES_VD15)                     ***/
    /****************************************************/
    #define PMC_RES_VD15_RWBITS_MASK32                  ((uint32)0x00008001U)
    #define PMC_RES_VD15_RESBITS_MASK32                 ((uint32)0x00000000U)
    #define PMC_RES_VD15_HVD15_A_MASK32                 ((uint32)0x00008000U)
    #define PMC_RES_VD15_HVD15_C_MASK32                 ((uint32)0x00000001U)

