marshallma21/AUTOSAR_SampleProject_MPC5748G/plugins/Mcu_TS_T2D35M10I0R0/include/Reg_eSys_MC_PCU.h
    /****************************************************/
    /***               (FEE_VD15)                     ***/
    /****************************************************/
    #define PMC_FEE_VD15_RWBITS_MASK32                  ((uint32)0x00008001U)
    #define PMC_FEE_VD15_RESBITS_MASK32                 ((uint32)0x00000000U)
    #define PMC_FEE_VD15_FEE15_A_MASK32                 ((uint32)0x00008000U)
    #define PMC_FEE_VD15_FEE15_C_MASK32                 ((uint32)0x00000001U)

    /****************************************************/
    /***               (VSIO)                         ***/
    /****************************************************/
    #define PMC_VSIO_RWBITS_MASK32                      ((uint32)0x00000700U)
    #define PMC_VSIO_RESBITS_MASK32                     ((uint32)0x00000000U)
    #define PMC_VSIO_VSIO_IF_MASK32                     ((uint32)0x00000400U)
    #define PMC_VSIO_VSIO_IJ_MASK32                     ((uint32)0x00000200U)
    #define PMC_VSIO_VSIO_IM_MASK32                     ((uint32)0x00000100U)



    /****************************************************/
    /***               (EPR_TD)                       ***/
    /****************************************************/
    #define PMC_EPR_TD_RWBITS_MASK32                    ((uint32)0x0000000DU)
    #define PMC_EPR_TD_RESBITS_MASK32                   ((uint32)0x00000000U)
    #define PMC_EPR_TD_TEMP_3_MASK32                    ((uint32)0x00000008U)
    #define PMC_EPR_TD_TEMP_2_MASK32                    ((uint32)0x00000004U)
    #define PMC_EPR_TD_TEMP_0_MASK32                    ((uint32)0x00000001U)

    /****************************************************/
    /***               (REE_TD)                       ***/
    /****************************************************/
    #define PMC_REE_TD_RWBITS_MASK32                    ((uint32)0x0000000DU)
    #define PMC_REE_TD_RESBITS_MASK32                   ((uint32)0x00000000U)
    #define PMC_REE_TD_TEMP_3_MASK32                    ((uint32)0x00000008U)
    #define PMC_REE_TD_TEMP_2_MASK32                    ((uint32)0x00000004U)
    #define PMC_REE_TD_TEMP_0_MASK32                    ((uint32)0x00000001U)

    /****************************************************/
    /***               (RES_TD)                       ***/
    /****************************************************/
    #define PMC_RES_TD_RWBITS_MASK32                    ((uint32)0x0000000DU)
    #define PMC_RES_TD_RESBITS_MASK32                   ((uint32)0x00000000U)
    #define PMC_RES_TD_TEMP_3_MASK32                    ((uint32)0x00000008U)
    #define PMC_RES_TD_TEMP_2_MASK32                    ((uint32)0x00000004U)
    #define PMC_RES_TD_TEMP_0_MASK32                    ((uint32)0x00000001U)

    /****************************************************/
    /***               (CTL_TD)                       ***/
    /****************************************************/
    #define PMC_CTL_TD_RWBITS_MASK32                    ((uint32)0x0000EF3FU)
    #define PMC_CTL_TD_RESBITS_MASK32                   ((uint32)0x00000000U)
    #define PMC_CTL_TD_IE_RWBITS_MASK32                 ((uint32)0x0000E000U)
    #define PMC_CTL_TD_TS3IE_MASK32                     ((uint32)0x00008000U)
    #define PMC_CTL_TD_TS2IE_MASK32                     ((uint32)0x00004000U)
    #define PMC_CTL_TD_TS0IE_MASK32                     ((uint32)0x00002000U)
    #define PMC_CTL_TD_DOUT_MASK32                      ((uint32)0x00000002U)
    #define PMC_CTL_TD_AOUT_MASK32                      ((uint32)0x00000001U)
    /** @violates @ref Reg_eSys_MC_PCU_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define PMC_CTL_TD_TRIM_ADJ_OVER_MASK32             ((uint32)0x00000F00U)
    /** @violates @ref Reg_eSys_MC_PCU_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define PMC_CTL_TD_TRIM_ADJ_UNDER_MASK32            ((uint32)0x0000003CU)

    /****************************************************/
    /***               (FEE_TD)                       ***/
    /****************************************************/
    #define PMC_FEE_TD_RWBITS_MASK32                    ((uint32)0x0000000DU)
    #define PMC_FEE_TD_RESBITS_MASK32                   ((uint32)0x00000000U)
    #define PMC_FEE_TD_FEE_TS3_MASK32                   ((uint32)0x00000008U)
    #define PMC_FEE_TD_FEE_TS2_MASK32                   ((uint32)0x00000004U)
    #define PMC_FEE_TD_FEE_TS0_MASK32                   ((uint32)0x00000001U)

#elif (IPV_MC == IPV_MC_04_06_01_00)
    /* PMC - Temperature Sensor Interrupt Enable Register (PMC_TS_IER). */
    #define PMC_TS_IER_ADDR32                           ((uint32)(PMC_BASEADDR + (uint32)0x00A4U))
    /* PMC - Temperature Event Status register (PMC_ESR_TD) */
    #define PMC_ESR_TD_ADDR32                           ((uint32)(PMC_BASEADDR + (uint32)0x00A8U))
    /* PMC - Temperature Reset Event Enable register (PMC_REE_TD). */
    #define PMC_REE_TD_ADDR32                           ((uint32)(PMC_BASEADDR + (uint32)0x00ACU))
    /* PMC - Temperature Reset Event Selection register (PMC_RES_TD). */
    #define PMC_RES_TD_ADDR32                           ((uint32)(PMC_BASEADDR + (uint32)0x00B0U))
    /* PMC - Temperature detector configuration register (PMC_CTL_TD). */
    #define PMC_CTL_TD_ADDR32                           ((uint32)(PMC_BASEADDR + (uint32)0x00B4U))
    /* PMC - Temperature Fault Injection Register (PMC_TS_FIR). */
    #define PMC_TS_FIR_ADDR32                           ((uint32)(PMC_BASEADDR + (uint32)0x00C0U))
    /* PMC - Temp Sensor Test Control Register (PMC_TS_TMC). */
    #define PMC_TS_TMC_ADDR32                           ((uint32)(PMC_BASEADDR + (uint32)0x00C4U))
    /* PMC - LVD Self Test Time Window Register (PMC_LVD_STTW). */
    #define PMC_LVD_STTW_ADDR32                         ((uint32)(PMC_BASEADDR + (uint32)0x00CCU))
    /* PMC - Voltage Detect User Mode Test Register (PMC_SELF_TEST_UM_VD_REG). */
    #define PMC_SELF_TEST_UM_VD_REG_ADDR32              ((uint32)(PMC_BASEADDR + (uint32)0x00D0U))
    /* PMC - FCCU Fault Injection Register (PMC_FIR) */
    #define PMC_FIR_ADDR32                              ((uint32)(PMC_BASEADDR + (uint32)0x00D4U))
    /* PMC - LVD HVD Interrupt Enable Control Register (PMC_LVD_HVD_INTR_ENB) */
    #define PMC_LVD_HVD_INTR_ENB_ADDR32                 ((uint32)(PMC_BASEADDR + (uint32)0x00D8U))
    /* PMC - LVD HVD Event Status Register (PMC_LVD_HVD_EVENT_STATUS). */
    #define PMC_LVD_HVD_EVENT_STATUS_ADDR32             ((uint32)(PMC_BASEADDR + (uint32)0x00DCU))
    /* PMC - Reset Enable Control Register (PMC_REE). */
    #define PMC_REE_ADDR32                              ((uint32)(PMC_BASEADDR + (uint32)0x00E0U))
    /* PMC - Reset Type ( Destructive / Functional) Selection Register (PMC_RES). */
    #define PMC_RES_ADDR32                              ((uint32)(PMC_BASEADDR + (uint32)0x00E4U))
    /* PMC - ADC Channel Select Register (PMC_ADC_CS). */
    #define PMC_ADC_CS_ADDR32                           ((uint32)(PMC_BASEADDR + (uint32)0x00E8U))


