marshallma21/AUTOSAR_SampleProject_MPC5748G/plugins/Mcu_TS_T2D35M10I0R0/include/Reg_eSys_MC_PCU.h
    /****************************************************/
    /***              PMC_TS_IER                      ***/
    /****************************************************/
    #define PMC_TS_IER_RWBITS_MASK32                    ((uint32)0x8000001BU)
    #define PMC_TS_IER_RESBITS_MASK32                   ((uint32)0x00000000U)

    #define PMC_TS_IER_TS_EN_MASK32                     ((uint32)0x80000000U)
    #define PMC_TS_IER_TS1_2IE_MASK32                   ((uint32)0x00000010U)
    #define PMC_TS_IER_TS1_0IE_MASK32                   ((uint32)0x00000008U)
    #define PMC_TS_IER_TS0_2IE_MASK32                   ((uint32)0x00000002U)
    #define PMC_TS_IER_TS0_0IE_MASK32                   ((uint32)0x00000001U)

    /****************************************************/
    /***              PMC_ESR_TD                      ***/
    /****************************************************/
    #define PMC_ESR_TD_RWBITS_MASK32                    ((uint32)0x0000001BU)
    #define PMC_ESR_TD_RESBITS_MASK32                   ((uint32)0x00000000U)

    #define PMC_ESR_TD_TEMP1_2_MASK32                   ((uint32)0x00000010U)
    #define PMC_ESR_TD_TEMP1_0_MASK32                   ((uint32)0x00000008U)
    #define PMC_ESR_TD_TEMP0_2_MASK32                   ((uint32)0x00000002U)
    #define PMC_ESR_TD_TEMP0_0_MASK32                   ((uint32)0x00000001U)

    /****************************************************/
    /***              PMC_REE_TD                      ***/
    /****************************************************/
    #define PMC_REE_TD_RWBITS_MASK32                    ((uint32)0x0000001BU)
    #define PMC_REE_TD_RESBITS_MASK32                   ((uint32)0x00000000U)

    #define PMC_REE_TD_TEMP1_2_MASK32                   ((uint32)0x00000010U)
    #define PMC_REE_TD_TEMP1_0_MASK32                   ((uint32)0x00000008U)
    #define PMC_REE_TD_TEMP0_2_MASK32                   ((uint32)0x00000002U)
    #define PMC_REE_TD_TEMP0_0_MASK32                   ((uint32)0x00000001U)

    /****************************************************/
    /***              PMC_RES_TD                      ***/
    /****************************************************/
    #define PMC_RES_TD_RWBITS_MASK32                    ((uint32)0x0000001BU)
    #define PMC_RES_TD_RESBITS_MASK32                   ((uint32)0x00000000U)

    #define PMC_RES_TD_TEMP1_2_MASK32                   ((uint32)0x00000010U)
    #define PMC_RES_TD_TEMP1_0_MASK32                   ((uint32)0x00000008U)
    #define PMC_RES_TD_TEMP0_2_MASK32                   ((uint32)0x00000002U)
    #define PMC_RES_TD_TEMP0_0_MASK32                   ((uint32)0x00000001U)

    /****************************************************/
    /***              PMC_CTL_TD                      ***/
    /****************************************************/
    #define PMC_CTL_TD_RWBITS_MASK32                    ((uint32)0x00000202U)
    #define PMC_CTL_TD_RESBITS_MASK32                   ((uint32)0x00000101U)

    #define PMC_CTL_TD_TS1_DOUT_EN_MASK32               ((uint32)0x00000200U)
    #define PMC_CTL_TD_TS0_DOUT_EN_MASK32               ((uint32)0x00000002U)

    /****************************************************/
    /***              PMC_TS_FIR                      ***/
    /****************************************************/
    #define PMC_TS_FIR_RWBITS_MASK32                    ((uint32)0x00000001U)

    /****************************************************/
    /***              PMC_TS_TMC                      ***/
    /****************************************************/
    #define PMC_TS_TMC_RWBITS_MASK32                    ((uint32)0x00000088U)
    #define PMC_TS_TMC_RESBITS_MASK32                   ((uint32)0x00000000U)

    #define PMC_TS_TMC_TS1_SELTSH_MASK32                ((uint32)0x00000080U)
    #define PMC_TS_TMC_TS0_SELTSH_MASK32                ((uint32)0x00000008U)

    /****************************************************/
    /***              PMC_LVD_STTW                    ***/
    /****************************************************/
    #define PMC_LVD_STTW_RWBITS_MASK32                  ((uint32)0x00000FFFU)
    #define PMC_LVD_STTW_RESBITS_MASK32                 ((uint32)0x00000000U)

    /****************************************************/
    /***         PMC_SELF_TEST_UM_VD_REG              ***/
    /****************************************************/
    /** @violates @ref Reg_eSys_MC_PCU_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define PMC_SELF_TEST_UM_VD_REG_RWBITS_MASK32       ((uint32)0x000200FFU)
    /** @violates @ref Reg_eSys_MC_PCU_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define PMC_SELF_TEST_UM_VD_REG_RESBITS_MASK32      ((uint32)0x00000000U)

    /** @violates @ref Reg_eSys_MC_PCU_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define PMC_SELF_TEST_UM_VD_REG_ST_RESULT_MASK32    ((uint32)0x00020000U)
    /** @violates @ref Reg_eSys_MC_PCU_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define PMC_SELF_TEST_UM_VD_REG_ST_DONE_MASK32      ((uint32)0x00010000U)
    /** @violates @ref Reg_eSys_MC_PCU_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define PMC_SELF_TEST_UM_VD_REG_ST_MODE_MASK32      ((uint32)0x000000C0U)
    /** @violates @ref Reg_eSys_MC_PCU_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define PMC_SELF_TEST_UM_VD_REG_VD_ST_CTRL_MASK32   ((uint32)0x0000003FU)

    /****************************************************/
    /***              PMC_FIR                         ***/
    /****************************************************/
    #define PMC_FIR_RWBITS_MASK32                       ((uint32)0x0000000BU)
    #define PMC_FIR_RESBITS_MASK32                      ((uint32)0x00000000U)

    #define PMC_FIR_STEST_FAULT_MASK32                  ((uint32)0x00000008U)
    #define PMC_FIR_HVD_FAULT_MASK32                    ((uint32)0x00000002U)
    #define PMC_FIR_LVD_FAULT_MASK32                    ((uint32)0x00000001U)

