marshallma21/AUTOSAR_SampleProject_MPC5748G/plugins/Mcu_TS_T2D35M10I0R0/include/Reg_eSys_MC_PCU.h
    /****************************************************/
    /***            PMC_LVD_HVD_INTR_ENB              ***/
    /****************************************************/
    /** @violates @ref Reg_eSys_MC_PCU_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define PMC_LVD_HVD_INTR_ENB_RWBITS_MASK32          ((uint32)0x8000447FU)
    /** @violates @ref Reg_eSys_MC_PCU_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define PMC_LVD_HVD_INTR_ENB_RESBITS_MASK32         ((uint32)0x00000000U)

    /** @violates @ref Reg_eSys_MC_PCU_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define PMC_LVD_HVD_INTR_ENB_PMC_ENABLE_MASK32      ((uint32)0x80000000U)
    /** @violates @ref Reg_eSys_MC_PCU_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define PMC_LVD_HVD_INTR_ENB_LVD_PMC_MASK32         ((uint32)0x00004000U)
    /** @violates @ref Reg_eSys_MC_PCU_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define PMC_LVD_HVD_INTR_ENB_LVD_SAR_ADC_MASK32     ((uint32)0x00000400U)
    /** @violates @ref Reg_eSys_MC_PCU_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define PMC_LVD_HVD_INTR_ENB_LVD_IO_MASK32          ((uint32)0x00000040U)
    /** @violates @ref Reg_eSys_MC_PCU_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define PMC_LVD_HVD_INTR_ENB_HVD_FLASH_MASK32       ((uint32)0x00000020U)
    /** @violates @ref Reg_eSys_MC_PCU_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define PMC_LVD_HVD_INTR_ENB_LVD_FLASH_MASK32       ((uint32)0x00000010U)
    /** @violates @ref Reg_eSys_MC_PCU_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define PMC_LVD_HVD_INTR_ENB_HVD_HV_MASK32          ((uint32)0x00000008U)
    /** @violates @ref Reg_eSys_MC_PCU_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define PMC_LVD_HVD_INTR_ENB_HVD_CORE_MASK32        ((uint32)0x00000004U)
    /** @violates @ref Reg_eSys_MC_PCU_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define PMC_LVD_HVD_INTR_ENB_LVD_CORE_HOT_MASK32    ((uint32)0x00000002U)
    /** @violates @ref Reg_eSys_MC_PCU_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define PMC_LVD_HVD_INTR_ENB_LVD_CORE_COLD_MASK32   ((uint32)0x00000001U)

    /****************************************************/
    /***          PMC_LVD_HVD_EVENT_STATUS            ***/
    /****************************************************/
    /** @violates @ref Reg_eSys_MC_PCU_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define PMC_LVD_HVD_EVENT_STATUS_RWBITS_MASK32      ((uint32)0x0001447FU)
    /** @violates @ref Reg_eSys_MC_PCU_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define PMC_LVD_HVD_EVENT_STATUS_RESBITS_MASK32     ((uint32)0x00000000U)

    /** @violates @ref Reg_eSys_MC_PCU_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define PMC_LVD_HVD_EVENT_LVD_BUDDY_MASK32          ((uint32)0x00010000U)
    /** @violates @ref Reg_eSys_MC_PCU_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define PMC_LVD_HVD_EVENT_LVD_PMC_MASK32            ((uint32)0x00004000U)
    /** @violates @ref Reg_eSys_MC_PCU_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define PMC_LVD_HVD_EVENT_LVD_SAR_ADC_MASK32        ((uint32)0x00000400U)
    #define PMC_LVD_HVD_EVENT_LVD_IO_MASK32             ((uint32)0x00000040U)
    /** @violates @ref Reg_eSys_MC_PCU_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define PMC_LVD_HVD_EVENT_HVD_FLASH_MASK32          ((uint32)0x00000020U)
    /** @violates @ref Reg_eSys_MC_PCU_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define PMC_LVD_HVD_EVENT_LVD_FLASH_MASK32          ((uint32)0x00000010U)
    #define PMC_LVD_HVD_EVENT_HVD_HV_MASK32             ((uint32)0x00000008U)
    /** @violates @ref Reg_eSys_MC_PCU_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define PMC_LVD_HVD_EVENT_HVD_CORE_MASK32           ((uint32)0x00000004U)
    /** @violates @ref Reg_eSys_MC_PCU_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define PMC_LVD_HVD_EVENT_LVD_CORE_HOT_MASK32       ((uint32)0x00000002U)
    /** @violates @ref Reg_eSys_MC_PCU_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define PMC_LVD_HVD_EVENT_LVD_CORE_COLD_MASK32      ((uint32)0x00000001U)

    /****************************************************/
    /***                      PMC_REE                 ***/
    /****************************************************/
    #define PMC_REE_RWBITS_MASK32                       ((uint32)0x0000042DU)
    #define PMC_REE_RESBITS_MASK32                      ((uint32)0x00004052U)

    #define PMC_REE_LVD_SAR_ADC_MASK32                  ((uint32)0x00000400U)
    #define PMC_REE_HVD_FLASH_MASK32                    ((uint32)0x00000020U)
    #define PMC_REE_HVD_HV_MASK32                       ((uint32)0x00000008U)
    #define PMC_REE_HVD_CORE_MASK32                     ((uint32)0x00000004U)
    #define PMC_REE_LVD_CORE_COLD_MASK32                ((uint32)0x00000001U)

    /****************************************************/
    /***                      PMC_RES                 ***/
    /****************************************************/
    #define PMC_RES_RWBITS_MASK32                       ((uint32)0x0000042DU)
    #define PMC_RES_RESBITS_MASK32                      ((uint32)0x00000000U)

    #define PMC_RES_LVD_SAR_ADC_MASK32                  ((uint32)0x00000400U)
    #define PMC_RES_HVD_FLASH_MASK32                    ((uint32)0x00000020U)
    #define PMC_RES_HVD_HV_MASK32                       ((uint32)0x00000008U)
    #define PMC_RES_HVD_CORE_MASK32                     ((uint32)0x00000004U)
    #define PMC_RES_LVD_CORE_HOT_MASK32                 ((uint32)0x00000002U)
    #define PMC_RES_LVD_CORE_COLD_MASK32                ((uint32)0x00000001U)

