marshallma21/AUTOSAR_SampleProject_MPC5748G/plugins/Mcu_TS_T2D35M10I0R0/include/Reg_eSys_MC_PCU.h
    /****************************************************/
    /***                   PMC_ADC_CS                 ***/
    /****************************************************/
    #define PMC_ADC_CS_RWBITS_MASK32                    ((uint32)0x0000033FU)
    #define PMC_ADC_CS_RESBITS_MASK32                   ((uint32)0x00000000U)

    /** @violates @ref Reg_eSys_MC_PCU_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define PMC_ADC_CS_STND_BY_RAM_BO_CLR_MASK32        ((uint32)0x00000200U)
    /** @violates @ref Reg_eSys_MC_PCU_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define PMC_ADC_CS_STND_BY_RAM_BR_DETCT_MASK32      ((uint32)0x00000100U)
    #define PMC_ADC_CS_ADC_CHSE_MASK32                  ((uint32)0x0000003FU)

#endif /* (IPV_MC == IPV_MC_04_04_01_00) */

/*==================================================================================================
*                                             ENUMS
==================================================================================================*/


/*==================================================================================================
*                                STRUCTURES AND OTHER TYPEDEFS
==================================================================================================*/


/*==================================================================================================
*                                GLOBAL VARIABLE DECLARATIONS
==================================================================================================*/


/*==================================================================================================
*                                    FUNCTION PROTOTYPES
==================================================================================================*/



#ifdef __cplusplus
}
#endif

#endif /* REG_ESYS_MC_PCU_H */

/** @} */
